package Main;

public class Task19 {

    /**
     * В методе main объяви две переменные a и b типа int.
     * Присвой им любые значения.
     * Выведи на экран их сумму и произведение.
     * Каждое значение выводить с новой строки.
     * <p>
     * Пример вывода на экран для а = 5, b = 7:
     * 12
     * 35
     * <p>
     * <p>
     * Требования:
     * 1. Программа должна выводить текст на экран.
     * 2. В программе должны быть только две переменные: a и b типа int.
     * 3. Переменным сразу должны быть присвоены значения.
     * 4. Метод main должен выводить на экран сумму переменных a и b.
     * 5. Метод main должен выводить на экран произведение переменных a и b.
     * 6. Каждое значение должно быть выведено с новой строки
     */

    public static void task() {
        //напишите тут ваш код
    	int a = 6;
    	int b = 10;
    	
    	System.out.println((a + b) + "\n" + (a * b));
    }

}