package com.company;

public class Task05_2 {
    /**
     * Создать объект типа Cat 2 раза.
     * Сохрани каждый экземпляр в свою переменную.
     * Имена переменных должны быть разные.
     *
     *
     * Требования:
     * 1. Программа не должна выводить текст на экран.
     * 2. В методе main должно быть только две переменные типа Cat.
     * 3. Переменным сразу должны быть присвоены значения.
     * 4. В классе Cat не должно быть переменных.
     * 5. В классе Cat не должно быть методов.
     */

    public static void main(String[] args) {
        Cat Simon = new Cat();
        Cat Masya = new Cat();
    }

    public static class Cat {

    }
}
