package lesson02.part01;

/**
 * Вывести на экран десять раз надпись "Я хочу большую зарплату, и для этого изучаю Java"
 * <p>
 * <p>
 * Требования:
 * 1.	Программа не должна считывать данные с клавиатуры.
 * 2.	Программа должна выводить текст.
 * 3.	Текст должен начинаться с "Я хочу".
 * 4.	Текст должен заканчиваться на "изучаю Java".
 * 5.	Текст должен состоять из 10 строк.
 * 6.	Выводимый текст должен соответствовать заданию.
 */

public class Task21 {
    public static void main(String[] args) {
        //напишите тут ваш код
    }
}
