package lesson02.part01;

/**
 * Реализуй метод public static void div(int a, int b).
 * Метод должен делить первое число на второе, и выводить на экран результат деления а на b.
 * <p>
 * На экран должно быть выведено целое число.
 * <p>
 * <p>
 * Требования:
 * 1.	Функция div должна делить а на b.
 * 2.	Функция div должна выводить результат деления на экран.
 * 3.	Функция main должна вызывать функцию div 3 раза.
 * 4.	Функция main не должна вызывать команду вывода текста на экран.
 * 5.	Программа должна вывести три числа: 2 1 0. Каждое число в отдельной строке.
 */

public class Task01 {
    public static void main(String[] args) {
        div(6, 3);
        div(10, 6);
        div(2, 4);
    }

    public static void div(int a, int b) {
        //напишите тут ваш код

    }
}
