package lesson01.part1;

public class Task10 {

    /**
     * Не думать о секундах…
     * Напиши код, который считает сколько секунд прошло с 15:00, если на часах 15:30. Выведи результат на экран.
     * <p>
     * <p>
     * Требования:
     * 1. Программа должна выводить текст.
     * 2. Выведенный текст должен быть целым положительным числом.
     * 3. Выведенное число должно быть кратно 60.
     * 4. Выводимое число должно соответствовать заданию.
     */

    public static void main(String[] args) {
<<<<<<< HEAD
        int secondsAfter15 = 0;
        System.out.println(secondsAfter15);
=======
>>>>>>> 0e1f9ccef6b9e889c7acce5defc37f7bc5a9a39d
    }
}
