package lesson01.part1;

public class Task03 {

    /**
     * Мой юный друг
     * Сейчас 2019 год. Наш университет основан 98 лет назад.
     * Написать программу, выводящую на экран год основания МТУСИ.
     *
     * Требования:
     * 1. Программа должна выводить текст.
     * 2. Выведенный год должен состоять из 4 цифр.
     * 3. Выведенный год должен начинаться с "19".
     * 4. Выведенный год должен соответствовать заданию.
     */

    public static void main(String[] args) {
<<<<<<< HEAD
        Calendar calendar = Calendar.getInstance();
        int Year = calendar.get(Calendar.YEAR);
        System.out.println(Year - 98);
=======
        // Напишите здесь ваш код
>>>>>>> 63ed5ccc4a76e65d25aa84e4a9540f22d1e60c19
    }
}
