package lesson01.part1;

public class Task01 {

    /**
     * Hello World!
     * Напиши программу, которая выводит на экран надпись:
     * Hello World!
     * Требования:
     * 1. Программа должна выводить текст.
     * 2. Текст должен начинаться с "Hello".
     * 3. Текст должен заканчиваться на "!".
     * 4. Текст должен состоять из 12 символов, включая пробелы и знаки препинания.
     * 5. Текст должен состоять из одной строки.
     */

    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
