package lesson01.part1;

public class Task02 {

    /**
     * Написать программу, выводящую на экран надпись "Hello World!" 3 раза. Каждый раз - с новой строки.
     * <p>
     * Пример вывода на экран:
     * Hello World!
     * Hello World!
     * Hello World!
     * Hello World!
     * <p>
     * Требования:
     * 1. Программа должна выводить текст.
     * 2. Текст должен начинаться с "Hello".
     * 3. Текст должен заканчиваться на "!".
     * 4. Текст должен состоять из 3 строк.
     * 5. Попробуй удалить метод main, в пустом месте написать psvm и нажать tab.
     */

    public static void main(String[] args) {
        System.out.println("Hello World!\nHello World!\nHello World!");
    }
}
