package lesson01.part2;

public class Task04 {

    /**
     * В методе main объяви две переменные a и b типа int.
     * Присвой им любые значения.
     * Выведи на экран их сумму и произведение.
     * Каждое значение выводить с новой строки.
     * <p>
     * Пример вывода на экран для а = 5, b = 7:
     * 12
     * 35
     * <p>
     * <p>
     * Требования:
     * 1. Программа должна выводить текст на экран.
     * 2. В программе должны быть только две переменные: a и b типа int.
     * 3. Переменным сразу должны быть присвоены значения.
     * 4. Метод main должен выводить на экран сумму переменных a и b.
     * 5. Метод main должен выводить на экран произведение переменных a и b.
     * 6. Каждое значение должно быть выведено с новой строки
     */

<<<<<<< HEAD
   public static void main(String[] args) {
        int a = 5;
        int b = 7;
        System.out.println(a+b);
        System.out.println(a*b);
=======
    public static void main(String[] args) {
        //напишите тут ваш код
>>>>>>> 63ed5ccc4a76e65d25aa84e4a9540f22d1e60c19
    }

}
