package lesson01.part2;

public class Task05 {

    /**
     * Создать объект типа Cat 2 раза.
     * Сохрани каждый экземпляр в свою переменную.
     * Имена переменных должны быть разные.
     * <p>
     * <p>
     * Требования:
     * 1. Программа не должна выводить текст на экран.
     * 2. В методе main должно быть только две переменные типа Cat.
     * 3. Переменным сразу должны быть присвоены значения.
     * 4. В классе Cat не должно быть переменных.
     * 5. В классе Cat не должно быть методов.
     */

    public static void main(String[] args) {
        //напишите тут ваш код
    }

    public static class Cat {

    }

}
