package lesson01.part2;

public class Task06 {

    /**
     * Необъективная реальность
     * Напиши программу, которая выводит на экран надпись: "Будешь плохо кодить, придет Java и съест твою память".
     * <p>
     * <p>
     * Требования:
     * 1. Программа должна выводить текст на экран.
     * 2. Текст должен начинаться с "Будешь".
     * 3. Текст должен заканчиваться на "память".
     * 4. Текст должен состоять из 52 символов, включая пробелы и знаки препинания.
     * 5. Выводимый текст должен соответствовать заданию.
     */

    public static void main(String[] args) {
        //напишите тут ваш код
    }
}
