package lesson01.part2;

public class Task06 {

    /**
     * Необъективная реальность
     * Напиши программу, которая выводит на экран надпись: "Будешь плохо кодить, придет Java и съест твою память".
     * <p>
     * <p>
     * Требования:
     * 1. Программа должна выводить текст на экран.
     * 2. Текст должен начинаться с "Будешь".
     * 3. Текст должен заканчиваться на "память".
     * 4. Текст должен состоять из 52 символов, включая пробелы и знаки препинания.
     * 5. Выводимый текст должен соответствовать заданию.
     */

<<<<<<< HEAD
   public static void main(String[] args) {
        System.out.println("Будешь плохо кодить, придет Java и съест твою память");
=======
    public static void main(String[] args) {
        //напишите тут ваш код
>>>>>>> 63ed5ccc4a76e65d25aa84e4a9540f22d1e60c19
    }
}
