package lesson01.part2;

public class Task08 {

    /**
     * Создай 10 переменных типа Cat и 8 объектов типа Cat.
     * <p>
     * <p>
     * Требования:
     * 1. Программа не должна выводить текст на экран.
     * 2. В методе main должно быть 10 переменных типа Cat.
     * 3. В методе main 8 переменных должны быть проинициализированы.
     * 4. В классе Cat не должно быть переменных.
     * 5. В классе Cat не должно быть методов.
     */

    public static void main(String[] args) {
        //напишите тут ваш код
        Cat cat8 = new Cat();
        Cat cat9;
        //напишите тут ваш код
    }

    public static class Cat {

    }
}
