package lesson05.part02;

/**
 * Выполняем перегрузку!
 * Написать два метода: print(int) и print(String).
 * <p>
 * <p>
 * Требования:
 * 1. Программа не должна выводить текст на экран.
 * 2. Класс Solution должен содержать три метода.
 * 3. Класс Solution должен содержать статический метод main().
 * 4. Класс Solution должен содержать статический метод print() с параметром типа int.
 * 5. Класс Solution должен содержать статический метод print() с параметром типа String.
 */

public class Task06 {
    public static void main(String[] args) {

    }

    //Напишите тут ваши методы
}
